{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hello",
        "Good day",
        "Hey",
        "Hi there",
        "What's up?",
        "How are you?",
        "Is anyone there?",
        "Greetings",
        "Howdy"
      ],
      "responses": [
        "Hello! I am ChatBotThabiso, here to assist you with DUT-related queries. How can I help you today?",
        "Hi there! I'm your DUT assistant. Feel free to ask any questions about Durban University of Technology.",
        "Good day! How can I assist you with DUT information?",
        "Hey! I’m here to provide answers to your DUT-related queries. What can I help you with?"
      ]
    },
    {
      "tag": "campus_location",
      "patterns": [
        "Where is DUT located?",
        "What is the address of DUT?",
        "Can you give me directions to DUT?",
        "Where can I find the DUT campus?",
        "What are the locations of DUT campuses?"
      ],
      "responses": [
        "DUT has multiple campuses, including Steve Biko Campus in Durban and Indumiso Campus in Pietermaritzburg. Let me know which campus details you need!",
        "You can find the main Durban campus at 41 Steve Biko Road, Durban. Would you like directions?"
      ]
    },
    {
      "tag": "admissions",
      "patterns": [
        "How do I apply to DUT?",
        "What is the application process for DUT?",
        "Can I apply online?",
        "Where do I get the application form for DUT?",
        "What are the requirements for admission at DUT?"
      ],
      "responses": [
        "You can apply to DUT online by visiting the DUT Admissions portal. Ensure you meet the requirements for your chosen program and submit all necessary documents.",
        "The application process includes filling out the form online, uploading your documents, and paying the application fee. Visit the official DUT website for details."
      ]
    },
    {
      "tag": "courses_offered",
      "patterns": [
        "What courses does DUT offer?",
        "Can you list programs at DUT?",
        "Does DUT have engineering programs?",
        "What courses are available in business?",
        "Does DUT offer short courses?"
      ],
      "responses": [
        "DUT offers a variety of courses in Engineering, ICT, Business, Health Sciences, and more. Visit the DUT website for a full list.",
        "Yes, DUT has programs in Engineering, Business Administration, Arts, and many more fields. Short courses are also available in areas like Project Management and Graphic Design."
      ]
    },
    {
      "tag": "student_portal",
      "patterns": [
        "How do I access the student portal?",
        "What is the link to the DUT student portal?",
        "Can you help me log into the portal?",
        "I forgot my portal password",
        "Where can I find my results online?"
      ],
      "responses": [
        "You can access the DUT student portal at [https://www.dut.ac.za/student_portal](https://www.dut.ac.za/student_portal). If you forgot your password, click the 'Forgot Password' option.",
        "The student portal provides access to your results, registration, and other academic information. Visit the link and log in with your student credentials."
      ]
    },
    {
      "tag": "fees",
      "patterns": [
        "What are the tuition fees at DUT?",
        "How much does it cost to study at DUT?",
        "What is the application fee?",
        "Can I pay my fees online?",
        "Where do I find banking details for DUT?"
      ],
      "responses": [
        "DUT tuition fees vary by program. Visit the fees section on the DUT website for a detailed breakdown.",
        "You can pay your fees online through the student portal or via EFT. For banking details, please visit [https://www.dut.ac.za/fees](https://www.dut.ac.za/fees)."
      ]
    },
    {
      "tag": "contact",
      "patterns": [
        "What is DUT's phone number?",
        "How can I contact DUT?",
        "Can I email DUT?",
        "Who do I talk to for more information?",
        "What are DUT's contact details?"
      ],
      "responses": [
        "You can contact DUT at +27 31 373 2000 or email info@dut.ac.za. Visit the website for department-specific contact details.",
        "For general inquiries, call DUT at +27 31 373 2000. You can also email admissions@dut.ac.za for application-related queries."
      ]
    },
    {
      "tag": "campus_facilities",
      "patterns": [
        "Does DUT have a library?",
        "What facilities are available at DUT?",
        "Is there a gym on campus?",
        "Does DUT provide Wi-Fi?",
        "What student resources are there at DUT?"
      ],
      "responses": [
        "DUT offers facilities like libraries, computer labs, Wi-Fi, and a student gym. Let me know if you need specific details about any facility.",
        "Yes, DUT provides access to libraries, student counseling, and other resources. Visit the DUT website for more information."
      ]
    },
    {
      "tag": "graduation",
      "patterns": [
        "When is the graduation ceremony?",
        "How do I apply for graduation?",
        "What are the requirements for graduation?",
        "Can I hire a graduation gown at DUT?",
        "When is the next graduation?"
      ],
      "responses": [
        "Graduation ceremonies are held annually. Check the DUT Graduation page for specific dates and details on how to apply.",
        "You can apply for graduation through the student portal. For gowns, visit the gown rental service on campus or contact your faculty."
      ]
    },
    {
      "tag": "emergency",
      "patterns": [
        "What is the campus emergency number?",
        "Who do I call for help on campus?",
        "Does DUT have campus security?",
        "How do I report an emergency?",
        "Is there a medical clinic on campus?"
      ],
      "responses": [
        "For emergencies, call DUT Security at +27 31 373 2233. The campus clinic is available for medical assistance during office hours.",
        "In case of an emergency, contact DUT security or your faculty's emergency contact person."
      ]
    }
  ]
}
